presentacion/app/views/subjects/_form.html.erb

    <%= form.label :professor_id %>
    <%= form.collection_select :professor_id, Professor.order(:name),:id,:name, include_blank: true %>
---
SELECT "professors".* FROM "professors" ORDER BY "professors"."name" ASC