app/controllers/subjects_controller.rb

  def index
    @subjects = Subject.all
---
SELECT "subjects".* FROM "subjects"

  def create
    @subject = Subject.new(subject_params)

    respond_to do |format|
      if @subject.save
---
INSERT INTO "subjects" ("name", "professor_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Organizacion de Datos"], ["professor_id", 2], ["created_at", "2019-05-20 23:06:03.235954"], ["updated_at", "2019-05-20 23:06:03.235954"]]

    def set_subject
      @subject = Subject.find(params[:id])
---
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]